Revit 2026 API

# DetailElementOrderUtils Methods

---

The DetailElementOrderUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AreDetailElements |  |
|  | BringForward(Document, View, ElementId) | Moves the given detail instance one step closer to the front of all other detail instances in the view. |
|  | BringForward(Document, View, ICollectionElementId) |  |
|  | BringToFront(Document, View, ElementId) | Places the given detail instance in the front of all other detail instances in the view. |
|  | BringToFront(Document, View, ICollectionElementId) |  |
|  | GetDrawOrderForDetails |  |
|  | IsDetailElement | Indicates if the element is a detail element that participates in detail draw ordering in the view. |
|  | SendBackward(Document, View, ElementId) | Moves the given detail instance one step closer to the back of all other detail instances in the view. |
|  | SendBackward(Document, View, ICollectionElementId) |  |
|  | SendToBack(Document, View, ElementId) | Places the given detail instance behind all detail instances in the view. |
|  | SendToBack(Document, View, ICollectionElementId) |  |

#### Reference

DetailElementOrderUtils Class

Autodesk.Revit.DB Namespace